Satachito/SliP/P4EV/sdkconfig.defaults
#	ESP32-P4-Function-EV-Board ( ESP32-P4 revision v3.2, 16 MB flash, 32 MB hex
#	PSRAM, and Espressif's own 7-inch 1024x600 panel on the MIPI-DSI connector ).
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

#	Not optional.  The interpreter reports every error by throwing, and dispatches
#	on type through dynamic_pointer_cast; without these two the build does not
#	compile, let alone run.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#	The console is the chip's own USB.  The board has a USB-to-UART bridge as
#	well, on its own connector; this uses the JTAG/serial port, which is the one
#	that also flashes.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

#	No revision lines here, unlike the Tab5.  That board's P4 is v1.3 and has to
#	ask for the pre-v3 half of a mutually exclusive Kconfig choice; this one is
#	v3.2, which is what ESP-IDF 5.5 defaults to.  Carrying the Tab5's two lines
#	over would have refused to flash this chip, which is the same wall from the
#	other side.

#	The panel this board ships with.  The BSP also knows a 1280x800 ILI9881C and
#	an HDMI bridge; this is the one in the box.
CONFIG_BSP_LCD_TYPE_1024_600=y

#	No LVGL.  The drawing here is a frame buffer and a font, as on the RP2350 and
#	the Tab5.
CONFIG_BSP_CONFIG_NO_GRAPHIC_LIB=y

#	PSRAM.  Not needed by the language, but 1024x600 at 16 bits is 1.2 MB and the
#	panel cannot start without somewhere to put it.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
